[{"description":"Create a professional contractor app with: 1) Address input that fetches property data and dimensions using Google Maps/geocoding, 2) Dashboard showing all projects and clients, 3) Navigation to different sections (Projects, Tools, Heat Map, Reports), 4) Modern blue/gray professional color scheme with responsive design, 5) Local storage for saving all data persistently","type":"feature","passes":true,"id":1},{"description":"Build fully functional project calculator system with these categories: ROOFING (calculate square footage, pitch, materials needed for shingles/metal/tile, include waste factor, price per square), WINDOWS (count, sizes, types - single/double hung/casement/sliding, price per window with installation), GUTTERS (linear feet, downspouts, corners, material type - aluminum/copper/vinyl, hangers needed), SIDING (square footage, material type - vinyl/fiber cement/wood, j-channel, trim, corners), DOORS (exterior/interior count, types, hardware), PAINTING (interior/exterior square footage, coats, primer), CONCRETE (cubic yards, square footage, thickness), FENCING (linear feet, height, material, posts, gates). Each calculator must show material quantities, labor hours, and total cost estimates","type":"feature","passes":true,"id":2},{"description":"Create comprehensive PDF report generator that exports professional contractor estimates including: company header area (editable), client information, property address, date, itemized project breakdown by category, material costs, labor costs, subtotals, tax, total bid amount, payment terms, timeline, terms and conditions, signature lines. Use jsPDF library. Include print-optimized styling and logo upload capability. Reports must be downloadable as PDF files with professional formatting","type":"feature","passes":true,"id":3},{"description":"Implement contractor tools section with: 1) Unit converter (feet/inches/meters, square feet/square meters/squares for roofing), 2) Pitch calculator (rise/run to degrees), 3) Material waste calculator (adds percentage for cuts and waste), 4) Stair calculator (rise, run, steps needed), 5) Concrete calculator (thickness, area to cubic yards), 6) Board feet calculator, 7) Paint coverage calculator, 8) Markup/margin calculator for pricing. All tools must be functional with real calculations and instant results","type":"feature","passes":true,"id":4},{"description":"Build heat map feature: user enters zip code, display map showing color-coded areas indicating contracting demand based on property age, income levels, and home values. Use real mapping library (Leaflet or Mapbox) with color gradients (red=high demand, yellow=medium, green=low). Include legend and area statistics (avg home age, avg value, estimated project demand). Make map interactive and zoomable","type":"feature","passes":true,"id":5},{"description":"Create pricing database with realistic 2024 material costs: roofing shingles ($80-150/square), metal roofing ($300-600/square), windows ($300-1200 per window), vinyl siding ($3-8/sq ft), gutters ($4-12/linear foot), doors ($500-3000), paint ($25-50/gallon), concrete ($100-150/cubic yard), fencing ($15-50/linear foot). Include labor rates by project type ($40-80/hour depending on trade). Make prices editable by user so they can customize for their market. Prices should auto-populate in calculators","type":"feature","passes":true,"id":6},{"description":"Build client and project management system: create/edit/delete clients with contact info, save multiple projects per client, track project status (quote/approved/in progress/completed), save all estimates with timestamps, search and filter projects, export project history. Store everything in browser localStorage with JSON structure. Include dashboard showing active projects count, total revenue, pending quotes","type":"feature","passes":true,"id":7},{"description":"Create bidding suggestion engine: analyze project total and suggest three bidding strategies: 1) COMPETITIVE (10-15% markup - for competitive markets), 2) STANDARD (20-25% markup - balanced approach), 3) PREMIUM (30-40% markup - high-end work). Show final bid prices for each strategy with profit margins. Include notes about when to use each strategy. Add market factors input (competition level, urgency, client type) that adjusts suggestions","type":"feature","passes":true,"id":8},{"description":"Add property dimension auto-calculation: when user enters address, attempt to estimate property dimensions using geocoding data. Show estimated: lot size, building square footage (if available), roof area estimation, perimeter for gutters/siding. Include manual override fields for all measurements. Add measurement tools: click to measure distances on integrated map view, save custom measurements per property","type":"feature","passes":true,"id":9},{"description":"Implement comprehensive form validation, error handling, loading states for all features. Add helpful tooltips explaining contractor terms. Include onboarding tutorial for first-time users. Add data export/import functionality (JSON) so users can backup and transfer their data. Include print stylesheet for estimate forms. Make entire app mobile-responsive for on-site use","type":"feature","passes":true,"id":10},{"description":"Integrate AI-powered automatic estimation system: When user enters an address in ProjectDetail page, add a prominent 'Generate AI Estimate' button next to the address input. When clicked, use OpenAI to analyze the property address and automatically generate a complete itemized estimate. The AI should determine likely needed work (roofing age/condition, windows needed, gutter replacement, siding condition, etc) and create realistic CalculatorResult items for each category. Use the AI SDK that's already installed (@ai-sdk/openai). Make the button visually prominent with loading states and show progress (Analyzing property... Calculating materials... Generating estimate...). After generation, automatically populate the project categories with the AI-generated items and show a success message with summary","type":"feature","passes":true,"id":11},{"description":"Create smart property analysis prompt engineering: Build a comprehensive system prompt that instructs the AI to act as an expert contractor. Given an address, the AI should estimate: 1) Likely home age (affects all repairs), 2) Estimated square footage and roof area, 3) Probable roofing needs (age-based replacement schedule), 4) Window count and likely replacements, 5) Gutter condition and linear feet, 6) Siding condition, 7) Other common repairs. The AI should return structured JSON with categories array containing type (roofing/windows/etc) and items with description, quantity, unit, materialCost, laborCost. Include realistic reasoning based on typical home construction in that area","type":"feature","passes":true,"id":12},{"description":"Add AI estimation settings and customization: In Settings page, add AI Estimation section where users can: 1) Toggle AI features on/off, 2) Set estimation style (Conservative/Standard/Comprehensive - affects how much work AI suggests), 3) Set default assumptions (typical home age in area, common materials used, climate factors), 4) Add local market notes that AI should consider. These settings should influence the AI prompts to give more accurate estimates for their specific market","type":"feature","passes":true,"id":13},{"description":"Implement AI estimate review and editing: After AI generates the estimate, show an 'AI Estimate Review' modal with all suggested items in an editable table. Users can check/uncheck items to include, adjust quantities, modify costs, and add notes before accepting. Include confidence indicators (high/medium/low) for each AI suggestion. Add 'Accept All', 'Accept Selected', and 'Regenerate' buttons. Make it clear these are AI suggestions that should be verified on-site","type":"feature","passes":true,"id":14},{"description":"Add AI assistant chat for estimate refinement: On the ProjectDetail page, add a floating chat button (bottom right). When clicked, opens an AI chat interface where users can ask questions like 'What if the roof is 20 years old?', 'Add painting to this estimate', 'Reduce window count to 10'. The AI maintains context of the current project and can modify the estimate based on conversational input. Use streaming responses for better UX. Store chat history per project","type":"feature","passes":true,"id":15},{"description":"Fix client name input field not working in ProjectDetail page. The client name input should be editable and save properly when user types. Check that the input onChange handler is correctly updating the project state. Ensure the value is being saved to localStorage when the Save button is clicked. Verify the input is not disabled by default. Make sure the clientName field is properly initialized in the project object","type":"bug","passes":true,"id":16},{"description":"Fix AI estimate generation not working. Debug the AI estimate button click handler - ensure it's making the correct API call to /api/estimate/generate endpoint. Check that the fetch is using POST method with correct headers. Verify the API endpoint exists and is properly handling the request. Add error handling and console logs to show what's failing. Make sure the OpenAI API key or AI SDK is configured correctly. If streaming fails, show clear error message to user","type":"bug","passes":true,"id":17},{"description":"Add comprehensive error handling and user feedback for AI estimation. If the AI call fails, show a helpful error message explaining what went wrong (network error, API key missing, service unavailable, etc). Add a retry button. Include fallback behavior - if AI fails, suggest user can still use manual calculators. Add console logging for debugging. Test with missing API credentials and handle gracefully","type":"bug","passes":true,"id":18},{"description":"Ensure editing mode works correctly in ProjectDetail. When user clicks Edit button, all fields including client name should become editable. When Save is clicked, all changes should persist. Verify the editing state is properly toggled. Check that the disabled prop on inputs respects the editing state. Make sure new projects start in editing mode by default","type":"bug","passes":true,"id":19}]
